xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonModules/ИИА_ВалидаторРезультата/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПроверитьРезультатВыполненияЗадачи(СсылкаДиалога) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ПроверкаВыполнена", Ложь);
	Результат.Вставить("Причина", "");

	ПоследнееСообщение = ИИА_Сервер.ПолучитьПоследнееСообщениеПользователя(СсылкаДиалога);
	Если НЕ ПоследнееСообщение.Найдено Тогда
		Результат.Причина = "Не найдена задача пользователя";
		Возврат Результат;
	КонецЕсли;

	ТекстЗадачи = ПоследнееСообщение.Текст;
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	ПоследнийСистРез = ПолучитьПоследнийDslSystemResult(СсылкаДиалога);
	Если ПоследнийСистРез.Найдено Тогда
		Если НЕ ПоследнийСистРез.Успех Тогда
			Результат.ПроверкаВыполнена = Ложь;
			Результат.Причина = "Последнее выполнение DSL завершилось ошибкой.";
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		КонецЕсли;
		Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
			ПроверкаВыводаРанняя = ПроверитьВыводДанныхЗапроса(СсылкаДиалога, ПоследнийСистРез.Данные);
			Если ПроверкаВыводаРанняя.ЕстьТабличныйДокумент Тогда
				Результат.ПроверкаВыполнена = Истина;
				Результат.Причина = "Данные выведены: " + ПроверкаВыводаРанняя.Причина;
				ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С
		И ЕстьПропущенныеКритичныеШагиПлана(СсылкаДиалога) Тогда
		Результат.ПроверкаВыполнена = Ложь;
		Результат.Причина = "План не завершен: критичные шаги запроса были пропущены.";
		ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
		Возврат Результат;
	КонецЕсли;
	Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С
		И ЕстьНезавершенныеКритичныеШагиПлана(СсылкаДиалога) Тогда
		Результат.ПроверкаВыполнена = Ложь;
		Результат.Причина = "План не завершен: результат запроса еще не выведен пользователю.";
		ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
		Возврат Результат;
	КонецЕсли;

	// ДЕТЕРМИНИРОВАННАЯ ПРОВЕРКА
	Если ПоследнийСистРез.Найдено Тогда

		Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
			ПроверкаВывода = ПроверитьВыводДанныхЗапроса(СсылкаДиалога, ПоследнийСистРез.Данные);
			Если ПроверкаВывода.ЕстьТабличныйДокумент Тогда
				Результат.ПроверкаВыполнена = Истина;
				Результат.Причина = "Данные выведены: " + ПроверкаВывода.Причина;
			Иначе
				Результат.ПроверкаВыполнена = Ложь;
				Результат.Причина = "Нет подтверждения вывода фактических данных запроса в сообщение или таблицу.";
			КонецЕсли;
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		Иначе
			Результат.ПроверкаВыполнена = Истина;
			Результат.Причина = "Последнее выполнение DSL успешно.";
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		КонецЕсли;

	КонецЕсли;

	ТекстРезультатов = "";
	Для Индекс = Макс(0, Диалог.Сообщения.Количество() - 20) По Диалог.Сообщения.Количество() - 1 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.Система Тогда
			ТекстРезультатов = ТекстРезультатов + Символы.ПС + СтрокаСообщения.Текст;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ПустаяСтрока(ТекстРезультатов) Тогда
		ТекстВРег = ВРег(ТекстРезультатов);
		ЕстьУспех = (СтрНайти(ТекстВРег, "DSL_SYSTEM_RESULT") > 0
			И СтрНайти(ТекстВРег, "SUCCESS") > 0
			И СтрНайти(ТекстВРег, "TRUE") > 0);
		ЕстьДанные = ТекстСодержитActionShowInfo(ТекстВРег)
			И (СтрНайти(ТекстВРег, "РЕЗУЛЬТАТ ЗАПРОСА") > 0 ИЛИ СтрНайти(ТекстВРег, "СТРОК") > 0);

		Если ЕстьУспех И ЕстьДанные И НЕ ТекстСодержитТехническуюЗаглушкуЗапроса(ТекстВРег) Тогда
			Если НЕ ТекстСодержитПустуюФормуЗапроса(ТекстВРег) Тогда
				Результат.ПроверкаВыполнена = Истина;
				Результат.Причина = "Подтверждено по системным результатам: результат запроса выведен.";
				ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		Если Диалог.ТипДиалога <> Перечисления.ИИА_ТипДиалога.Запрос1С
			И ЕстьУспех
			И СтрНайти(ТекстВРег, "SHOWINFO") > 0 Тогда
			Результат.ПроверкаВыполнена = Истина;
			Результат.Причина = "Подтверждено по системным результатам: действие выполнено и результат сообщен пользователю.";
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	ПромптПроверки = ИИА_Промты.СформироватьПромптПроверкиЗадачи(ТекстЗадачи, ТекстРезультатов);
	РезультатВызова = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптПроверки, "", "dsl", , Ложь, Ложь);

	ТекстОтвета = "";
	DSLДляРазбора = "";

	Если РезультатВызова.ТипОтвета = "DSL" И НЕ ПустаяСтрока(РезультатВызова.DSL) Тогда
		DSLДляРазбора = РезультатВызова.DSL;
	ИначеЕсли РезультатВызова.ТипОтвета = "ОшибкаКонтракта"
		И РезультатВызова.Свойство("DSL")
		И НЕ ПустаяСтрока(РезультатВызова.DSL) Тогда
		DSLДляРазбора = РезультатВызова.DSL;
	КонецЕсли;

	Если НЕ ПустаяСтрока(DSLДляРазбора) Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(DSLДляРазбора);
			Сценарий = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			Если ТипЗнч(Сценарий) = Тип("Структура") Тогда
				Если Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") Тогда
					Для Каждого Шаг Из Сценарий.steps Цикл
						Если Шаг.action = "ShowInfo" И Шаг.Свойство("message") Тогда
							ТекстОтвета = Шаг.message;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли Сценарий.Свойство("action") Тогда
					Если ВРег(Сценарий.action) = "SHOWINFO" И Сценарий.Свойство("message") Тогда
						ТекстОтвета = Сценарий.message;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			// ignored
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;

	Если ПустаяСтрока(ТекстОтвета) Тогда
		ТекстОтвета = РезультатВызова.Текст;
	КонецЕсли;

	ТекстОтветаВРег = ВРег(ТекстОтвета);

	Если СтрНачинаетсяС(ТекстОтветаВРег, "ДА")
		ИЛИ СтрНачинаетсяС(ТекстОтветаВРег, "'ДА")
		ИЛИ СтрНачинаетсяС(ТекстОтветаВРег, """ДА") Тогда

		Диалог = СсылкаДиалога.ПолучитьОбъект();
		Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда

			ТаблицаПоказана = Ложь;
			РезультатИзХранилища = ИИА_Сервер.ПолучитьРезультатПроверкиИзХранилища(СсылкаДиалога);
			Если РезультатИзХранилища <> Неопределено И РезультатИзХранилища.Свойство("ТаблицаПоказана") Тогда
				ТаблицаПоказана = РезультатИзХранилища.ТаблицаПоказана;
			КонецЕсли;

			Если ТаблицаПоказана Тогда
				ЕстьТабличныйДокумент = Истина;
				ПричинаЛога = "Явный флаг ТаблицаПоказана из хранилища";
			Иначе
				ЕстьТабличныйДокумент = Ложь;
				ПричинаЛога = "";
				КоличествоСообщений = Диалог.Сообщения.Количество();
				Для Индекс = Макс(0, КоличествоСообщений - 6) По КоличествоСообщений - 2 Цикл
					СтрокаСообщения = Диалог.Сообщения[Индекс];
					Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.ИИ И СтрокаСообщения.ТипСообщения = Перечисления.ИИА_ТипСообщения.Код Тогда
						Попытка
							ЧтениеJSON = Новый ЧтениеJSON;
							ЧтениеJSON.УстановитьСтроку(СтрокаСообщения.ТекстКода);
							Сценарий = ПрочитатьJSON(ЧтениеJSON);
							ЧтениеJSON.Закрыть();

							Если Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") Тогда
								Для Каждого Шаг Из Сценарий.steps Цикл
									Если Шаг.Свойство("action") И (ВРег(Шаг.action) = "RUNQUERY" ИЛИ ВРег(Шаг.action) = "SHOWINFO") Тогда
										ЕстьТабличныйДокумент = Истина;
										ПричинаЛога = "Найден шаг " + Шаг.action + " в сообщении ИИ #" + Индекс;
										Прервать;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						Исключение
							ТекстКодаВРег = ВРег(СтрокаСообщения.ТекстКода);
							Если СтрНайти(ТекстКодаВРег, "RUNQUERY") > 0 Тогда
								ЕстьТабличныйДокумент = Истина;
								ПричинаЛога = "Найдена подстрока RUNQUERY в сообщении ИИ #" + Индекс;
							ИначеЕсли СтрНайти(ТекстКодаВРег, "SHOWINFO") > 0 Тогда
								ЕстьТабличныйДокумент = Истина;
								ПричинаЛога = "Найдена подстрока SHOWINFO в сообщении ИИ #" + Индекс;
							КонецЕсли;
						КонецПопытки;

						Если ЕстьТабличныйДокумент Тогда
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;

			ЗаписьЛога = "Проверка наличия вывода данных: " + ?(ЕстьТабличныйДокумент, "ДА (" + ПричинаЛога + ")", "НЕТ");
			ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ЗаписьЛога);

			Если НЕ ЕстьТабличныйДокумент Тогда
				Результат.ПроверкаВыполнена = Ложь;
				Результат.Причина = "ИИ считает задачу выполненной, но не был выполнен шаг RunQuery для отображения данных (ТабличныйДокумент). Обязательно выполни запрос к базе данных.";
			Иначе
				Результат.ПроверкаВыполнена = Истина;
				Результат.Причина = ТекстОтвета;
			КонецЕсли;

		Иначе
			Результат.ПроверкаВыполнена = Истина;
			Результат.Причина = ТекстОтвета;
		КонецЕсли;

	Иначе
		Результат.ПроверкаВыполнена = Ложь;
		Результат.Причина = ТекстОтвета;
	КонецЕсли;

	ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
	Возврат Результат;

КонецФункции

Функция ТекстСодержитActionShowInfo(ТекстВРег)

	Если ПустаяСтрока(ТекстВРег) Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекстБезПробелов = СтрЗаменить(ТекстВРег, " ", "");
	ТекстБезПробелов = СтрЗаменить(ТекстБезПробелов, Символы.ПС, "");
	ТекстБезПробелов = СтрЗаменить(ТекстБезПробелов, Символы.ВК, "");
	ТекстБезПробелов = СтрЗаменить(ТекстБезПробелов, Символы.Таб, "");

	Возврат СтрНайти(ТекстБезПробелов, """ACTION"":""SHOWINFO""") > 0;

КонецФункции

Функция ТекстСодержитПустуюФормуЗапроса(ТекстВРег)

	Если ПустаяСтрока(ТекстВРег) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат СтрНайти(ТекстВРег, "СТРОК=0, КОЛОНОК=0") > 0
		ИЛИ СтрНайти(ТекстВРег, "СТРОК 0, КОЛОНОК 0") > 0
		ИЛИ СтрНайти(ТекстВРег, "СТРОК=0,КОЛОНОК=0") > 0;

КонецФункции

Функция ТекстСодержитТехническуюЗаглушкуЗапроса(ТекстВРег)

	Если ПустаяСтрока(ТекстВРег) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат СтрНайти(ТекстВРег, "1. Н: 1") > 0
		ИЛИ СтрНайти(ТекстВРег, "1. ЗНАЧЕНИЕ: 1") > 0
		ИЛИ СтрНайти(ТекстВРег, """COLUMNS"": [ ""Н"" ]") > 0
		ИЛИ СтрНайти(ТекстВРег, """COLUMNS"": [ ""ЗНАЧЕНИЕ"" ]") > 0;

КонецФункции

Функция ПолучитьПоследнийDslSystemResult(СсылкаДиалога)

	Результат = Новый Структура;
	Результат.Вставить("Найдено", Ложь);
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Текст", "");
	Результат.Вставить("Данные", Неопределено);

	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Результат;
	КонецЕсли;

	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Если Диалог.Сообщения.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Для Индекс = Диалог.Сообщения.Количество() - 1 По 0 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.Система
			И НЕ ПустаяСтрока(СтрокаСообщения.Текст)
			И СтрНайти(СтрокаСообщения.Текст, "dsl_system_result") > 0 Тогда

			ТекстJSON = ИИА_DSL.НормализоватьJSONТекст(СтрокаСообщения.Текст);

			Результат.Найдено = Истина;
			Результат.Текст = ?(ПустаяСтрока(ТекстJSON), СтрокаСообщения.Текст, ТекстJSON);

			Если НЕ ПустаяСтрока(ТекстJSON) Тогда
				Попытка
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(ТекстJSON);
					Данные = ПрочитатьJSON(ЧтениеJSON);
					ЧтениеJSON.Закрыть();

					Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("success") Тогда
						Результат.Успех = Данные.success;
					КонецЕсли;
					Если ТипЗнч(Данные) = Тип("Структура") Тогда
						Результат.Данные = Данные;
					КонецЕсли;
				Исключение
					ТекстОшибки = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;

			Возврат Результат;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПроверитьВыводДанныхЗапроса(СсылкаДиалога, СистемныйРезультат = Неопределено)

	Результат = Новый Структура("ЕстьТабличныйДокумент, Причина", Ложь, "");
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Результат;
	КонецЕсли;

	Диалог = СсылкаДиалога.ПолучитьОбъект();

	ТаблицаПоказана = Ложь;
	РезультатИзХранилища = ИИА_Сервер.ПолучитьРезультатПроверкиИзХранилища(СсылкаДиалога);
	Если РезультатИзХранилища <> Неопределено
		И ТипЗнч(РезультатИзХранилища) = Тип("Структура")
		И РезультатИзХранилища.Свойство("ТаблицаПоказана") Тогда
		ТаблицаПоказана = РезультатИзХранилища.ТаблицаПоказана;
	КонецЕсли;

	Если ТаблицаПоказана Тогда
		Результат.ЕстьТабличныйДокумент = Истина;
		Результат.Причина = "Явный флаг ТаблицаПоказана из хранилища";
		Возврат Результат;
	КонецЕсли;

	Если ЕстьДанныеВDslSystemResult(СистемныйРезультат) Тогда
		Результат.ЕстьТабличныйДокумент = Истина;
		Результат.Причина = "dsl_system_result содержит содержательный ShowInfo";
		Возврат Результат;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ЕстьДанныеВDslSystemResult(СистемныйРезультат)

	Если СистемныйРезультат = Неопределено Или ТипЗнч(СистемныйРезультат) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если RunQueryИмеетНекорректнуюФормуРезультата(СистемныйРезультат) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если СистемныйРезультат.Свойство("steps") И ТипЗнч(СистемныйРезультат.steps) = Тип("Массив") Тогда
		Для Каждого Шаг Из СистемныйРезультат.steps Цикл
			Если ТипЗнч(Шаг) = Тип("Структура")
				И Шаг.Свойство("action")
				И ВРег(Строка(Шаг.action)) = "SHOWINFO"
				И Шаг.Свойство("success")
				И Шаг.success
				И Шаг.Свойство("message")
				И СообщениеShowInfoСодержитРезультат(Шаг.message) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если СистемныйРезультат.Свойство("run_query")
		И ТипЗнч(СистемныйРезультат.run_query) = Тип("Массив") Тогда
		Для Каждого ДанныеЗапроса Из СистемныйРезультат.run_query Цикл
			Если ТипЗнч(ДанныеЗапроса) = Тип("Структура")
				И НЕ ДанныеЗапросаПохожиНаТехническуюЗаглушку(ДанныеЗапроса)
				И ДанныеЗапроса.Свойство("columns")
				И ТипЗнч(ДанныеЗапроса.columns) = Тип("Массив")
				И ДанныеЗапроса.columns.Количество() > 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция RunQueryИмеетНекорректнуюФормуРезультата(СистемныйРезультат)

	Если СистемныйРезультат = Неопределено Или ТипЗнч(СистемныйРезультат) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ СистемныйРезультат.Свойство("run_query")
		Или ТипЗнч(СистемныйРезультат.run_query) <> Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ДанныеЗапроса Из СистемныйРезультат.run_query Цикл
		Если ТипЗнч(ДанныеЗапроса) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если ДанныеЗапроса.Свойство("columns")
			И ТипЗнч(ДанныеЗапроса.columns) = Тип("Массив")
			И ДанныеЗапроса.columns.Количество() = 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция СообщениеShowInfoСодержитРезультат(Сообщение)

	Текст = СокрЛП(Строка(Сообщение));
	Если ПустаяСтрока(Текст) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрНайти(ВРег(Текст), "1. Н: 1") > 0
		ИЛИ СтрНайти(ВРег(Текст), "1. ЗНАЧЕНИЕ: 1") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекстВРег = ВРег(Текст);
	Если СтрНайти(ТекстВРег, "РЕЗУЛЬТАТ ЗАПРОСА") > 0
		ИЛИ СтрНайти(ТекстВРег, "СТРОК") > 0
		ИЛИ СтрНайти(ТекстВРег, "НЕТ ДАННЫХ") > 0
		ИЛИ СтрНайти(ТекстВРег, "ДАННЫЕ НЕ НАЙДЕНЫ") > 0 Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат СтрНайти(Текст, Символы.ПС) > 0 И СтрДлина(Текст) > 40;

КонецФункции

Функция ДанныеЗапросаПохожиНаТехническуюЗаглушку(ДанныеЗапроса)

	Если ТипЗнч(ДанныеЗапроса) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ДанныеЗапроса.Свойство("row_count") Или Число(ДанныеЗапроса.row_count) <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ДанныеЗапроса.Свойство("columns") Или ТипЗнч(ДанныеЗапроса.columns) <> Тип("Массив") Или ДанныеЗапроса.columns.Количество() <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяКолонки = ВРег(Строка(ДанныеЗапроса.columns[0]));
	Если ИмяКолонки <> "Н" И ИмяКолонки <> "ЗНАЧЕНИЕ" Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ДанныеЗапроса.Свойство("rows") Или ТипЗнч(ДанныеЗапроса.rows) <> Тип("Массив") Или ДанныеЗапроса.rows.Количество() <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	СтрокаДанных = ДанныеЗапроса.rows[0];
	Если ТипЗнч(СтрокаДанных) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ СтрокаДанных.Свойство(ДанныеЗапроса.columns[0]) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Строка(СтрокаДанных[ДанныеЗапроса.columns[0]]) = "1";

КонецФункции

Функция ЕстьПропущенныеКритичныеШагиПлана(СсылкаДиалога)

	План = ИИА_TypedPlan.ПолучитьTypedPlan(СсылкаДиалога);
	Если План = Неопределено Или НЕ План.Свойство("steps") Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ШагПлана Из План.steps Цикл
		Если ТипЗнч(ШагПлана) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Статус = ВРег(Строка(?(ШагПлана.Свойство("status"), ШагПлана.status, "")));
		Если Статус <> "SKIPPED" Тогда
			Продолжить;
		КонецЕсли;

		РезультатШага = ВРег(Строка(?(ШагПлана.Свойство("result_summary"), ШагПлана.result_summary, "")));
		ВидШага = ВРег(Строка(?(ШагПлана.Свойство("kind"), ШагПлана.kind, "")));
		Если СтрНайти(РезультатШага, "ЛИМИТ ИТЕРАЦИЙ") > 0
			ИЛИ ВидШага = "RUN_QUERY"
			ИЛИ ВидШага = "SHOW_INFO" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ЕстьНезавершенныеКритичныеШагиПлана(СсылкаДиалога)

	План = ИИА_TypedPlan.ПолучитьTypedPlan(СсылкаДиалога);
	Если План = Неопределено Или НЕ План.Свойство("steps") Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ШагПлана Из План.steps Цикл
		Если ТипЗнч(ШагПлана) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		ВидШага = ВРег(Строка(?(ШагПлана.Свойство("kind"), ШагПлана.kind, "")));
		Если ВидШага <> "SHOW_INFO" Тогда
			Продолжить;
		КонецЕсли;
		Статус = ВРег(Строка(?(ШагПлана.Свойство("status"), ШагПлана.status, "")));
		Если Статус <> "DONE" И Статус <> "SKIPPED" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сжимает JSON в одну строку для компактного вывода в лог (убирает переносы и лишние пробелы).
//
Функция СжатьJSONДляЛога(ТекстJSON)
	Если ПустаяСтрока(ТекстJSON) Тогда
		Возврат "";
	КонецЕсли;
	Результат = СтрЗаменить(ТекстJSON, Символы.ПС, " ");
	Результат = СтрЗаменить(Результат, Символы.ВТаб, " ");
	Пока СтрНайти(Результат, "  ") > 0 Цикл
		Результат = СтрЗаменить(Результат, "  ", " ");
	КонецЦикла;
	Возврат СокрЛП(Результат);
КонецФункции

#КонецОбласти
